export const maingroup = [
  { กลุ่ม: "1", รหัสกลุ่ม: "2199101", start: 1, end: 40 },
  { กลุ่ม: "2", รหัสกลุ่ม: "2199102", start: 41, end: 45 },
  { กลุ่ม: "3", รหัสกลุ่ม: "2199103", start: 46, end: 90 },
  { กลุ่ม: "4", รหัสกลุ่ม: "2199104", start: 91, end: 135 },
  { กลุ่ม: "5", รหัสกลุ่ม: "2199105", start: 136, end: 140 },
  { กลุ่ม: "6", รหัสกลุ่ม: "2199106", start: 141, end: 150 },
  { กลุ่ม: "7", รหัสกลุ่ม: "2199107", start: 151, end: 180 },
  { กลุ่ม: "8", รหัสกลุ่ม: "2199108", start: 181, end: 230 },
  { กลุ่ม: "9", รหัสกลุ่ม: "2199109", start: 231, end: 270 },
  { กลุ่ม: "10", รหัสกลุ่ม: "2199110", start: 271, end: 280 },
  { กลุ่ม: "11", รหัสกลุ่ม: "2199111", start: 281, end: 300 },
  { กลุ่ม: "12", รหัสกลุ่ม: "2199112", start: 301, end: 330 },
  { กลุ่ม: "13", รหัสกลุ่ม: "2199113", start: 331, end: 380 },
  { กลุ่ม: "14", รหัสกลุ่ม: "2199114", start: 381, end: 405 },
  { กลุ่ม: "15", รหัสกลุ่ม: "2199115", start: 406, end: 425 },
  { กลุ่ม: "16", รหัสกลุ่ม: "2199116", start: 426, end: 470 },
  { กลุ่ม: "17", รหัสกลุ่ม: "2199117", start: 471, end: 485 },
  { กลุ่ม: "18", รหัสกลุ่ม: "2199118", start: 486, end: 495 },
  { กลุ่ม: "19", รหัสกลุ่ม: "2199119", start: 496, end: 540 },
  { กลุ่ม: "20", รหัสกลุ่ม: "2199120", start: 541, end: 545 },
  { กลุ่ม: "21", รหัสกลุ่ม: "2199121", start: 546, end: 550 },
  { กลุ่ม: "22", รหัสกลุ่ม: "2199122", start: 551, end: 605 },
  { กลุ่ม: "23", รหัสกลุ่ม: "2199123", start: 606, end: 665 },
  { กลุ่ม: "24", รหัสกลุ่ม: "2199124", start: 666, end: 675 },
  { กลุ่ม: "25", รหัสกลุ่ม: "2199125", start: 676, end: 685 },
  { กลุ่ม: "26", รหัสกลุ่ม: "2199126", start: 686, end: 720 },
  { กลุ่ม: "27", รหัสกลุ่ม: "2199127", start: 721, end: 725 },
  { กลุ่ม: "28", รหัสกลุ่ม: "2199128", start: 726, end: 760 },
  { กลุ่ม: "29", รหัสกลุ่ม: "2199129", start: 761, end: 780 },
  { กลุ่ม: "30", รหัสกลุ่ม: "2199130", start: 781, end: 785 },
  { กลุ่ม: "31", รหัสกลุ่ม: "2199131", start: 786, end: 800 },
  { กลุ่ม: "32", รหัสกลุ่ม: "2199132", start: 801, end: 830 },
  { กลุ่ม: "33", รหัสกลุ่ม: "2199133", start: 831, end: 845 }
];

export const expenggroup = [
  { เซ็ค: 1, start: 1, end: 35 },
  { เซ็ค: 2, start: 36, end: 70 },
  { เซ็ค: 3, start: 71, end: 105 },
  { เซ็ค: 4, start: 106, end: 140 },
  { เซ็ค: 5, start: 141, end: 175 },
  { เซ็ค: 6, start: 176, end: 210 },
  { เซ็ค: 7, start: 211, end: 245 },
  { เซ็ค: 8, start: 246, end: 280 },
  { เซ็ค: 9, start: 281, end: 315 },
  { เซ็ค: 10, start: 316, end: 350 },
  { เซ็ค: 11, start: 351, end: 385 },
  { เซ็ค: 12, start: 386, end: 420 },
  { เซ็ค: 13, start: 421, end: 455 },
  { เซ็ค: 14, start: 456, end: 490 },
  { เซ็ค: 15, start: 491, end: 525 },
  { เซ็ค: 16, start: 526, end: 560 },
  { เซ็ค: 17, start: 561, end: 595 },
  { เซ็ค: 18, start: 596, end: 630 },
  { เซ็ค: 19, start: 631, end: 665 },
  { เซ็ค: 20, start: 666, end: 700 },
  { เซ็ค: 21, start: 701, end: 735 },
  { เซ็ค: 22, start: 736, end: 770 },
  { เซ็ค: 23, start: 771, end: 805 },
  { เซ็ค: 24, start: 806, end: 845 }
];

export const cpgroup = [
  {
    start: 426,
    end: 495,
    texts: ["วิชา 2110215 Prog Meth I", "วิชา 2110221 Com Eng Ess"]
  }
];

export default {
  maingroup,
  expenggroup,
  cpgroup
};
